{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_2", "function_type": "lambda", "output_shape": [64, 64, 3], "arguments": {}, "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-4-1d21d0e31cf0>\u00da\b<lambda>\u0099\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "batch_input_shape": [null, 64, 64, 3], "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 24, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "name": "Conv1", "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_10", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 12, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "name": "Conv2", "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_11", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "p": 0.3, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 48, "nb_col": 5, "b_regularizer": null, "nb_row": 5, "trainable": true, "activation": "linear", "name": "Conv3", "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_12", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "name": "Conv4", "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_13", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 64, "nb_col": 3, "b_regularizer": null, "nb_row": 3, "trainable": true, "activation": "linear", "name": "Conv5", "W_constraint": null, "activity_regularizer": null, "init": "he_normal", "bias": true, "dim_ordering": "tf", "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_14", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 1164, "W_regularizer": null, "b_regularizer": null, "input_dim": 64, "W_constraint": null, "activation": "linear", "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_15", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 100, "W_regularizer": null, "b_regularizer": null, "input_dim": 1164, "W_constraint": null, "activation": "linear", "name": "dense_7", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_16", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 50, "W_regularizer": null, "b_regularizer": null, "input_dim": 100, "W_constraint": null, "activation": "linear", "name": "dense_8", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_17", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 10, "W_regularizer": null, "b_regularizer": null, "input_dim": 50, "W_constraint": null, "activation": "linear", "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_18", "trainable": true, "alpha": 1.0}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "p": 0.2, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "input_dim": 10, "W_constraint": null, "activation": "linear", "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true}}], "keras_version": "1.2.0"}